app/controllers/application_controller.rb

  def navbar
    @croisieres_napolitain = Croisiere.all.reverse
---
SELECT "croisieres".* FROM "croisieres"