app/controllers/blogs_controller.rb

  def index
    @articles = Blog.all.reverse
---
SELECT "blogs".* FROM "blogs"

  def new
    @article = Blog.new
    @articles = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def create
    @article = Blog.new(params_blog)
    if @article.save
---
INSERT INTO "blogs" ("titre", "description", "image", "video", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    find_article
    @article.update(params_blog)
---
UPDATE "blogs" SET "description" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3

  def find_article
    @article = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]