app/controllers/contact_forms_controller.rb

INSERT INTO "contact_forms" ("firstname", "lastname", "email", "content", "created_at", "updated_at", "date_depart", "date_arrivee", "nb_enfant", "nb_adulte", "age_enfant") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
def create
  @contact_form = ContactForm.new(contact_page_params)
  if @contact_form.save