app/controllers/croisieres_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."croisiere_id" = $1  [["croisiere_id", 27]]
---
  def show
    find_croisiere
    @contact_form = ContactForm.new
    @reviews = Review.where(croisiere_id: @croisiere.id).reverse
    @review = Review.new
    @croisieres_par_destination = Croisiere.where(croisiere_destination: @croisiere.croisiere_destination)
    if @reviews.count != 0
      sum_reviews = 0
      @reviews.each {|num| sum_reviews += num.rating.to_i}