app/controllers/croisieres_controller.rb

SELECT "croisieres".* FROM "croisieres"
---
  def index
    croisieres_all = Croisiere.all

SELECT "croisieres".* FROM "croisieres"
---
  def new
    @croisiere = Croisiere.new
    @croisieres = Croisiere.all

INSERT INTO "croisieres" ("photo", "titre", "description", "carte", "tarif", "duree", "created_at", "updated_at", "croisiere_destination") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
     @croisiere = Croisiere.new(params_croisiere)
     if @croisiere.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."croisiere_id" = $1  [["croisiere_id", 24]]
SELECT "croisieres".* FROM "croisieres" WHERE "croisieres"."croisiere_destination" = $1  [["croisiere_destination", "Martinique"]]
---
  def show
    find_croisiere
    @contact_form = ContactForm.new
    @reviews = Review.where(croisiere_id: @croisiere.id).reverse
    @review = Review.new
    @croisieres_par_destination = Croisiere.where(croisiere_destination: @croisiere.croisiere_destination)

UPDATE "croisieres" SET "titre" = $1, "updated_at" = $2 WHERE "croisieres"."id" = $3  [["titre", "Croisière des Trois Pitons de la mort qui tue"], ["updated_at", "2018-08-06 12:24:44.986263"], ["id", 31]]
---
  def update
    find_croisiere
    @croisiere.update(params_croisiere)

DELETE FROM "croisieres" WHERE "croisieres"."id" = $1  [["id", 27]]
---
  def destroy
    find_croisiere
    @croisiere.destroy

SELECT  "croisieres".* FROM "croisieres" WHERE "croisieres"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
   def find_croisiere
    @croisiere = Croisiere.find(params[:id])