app/controllers/pages_controller.rb

SELECT "croisieres".* FROM "croisieres"
SELECT  "reviews".* FROM "reviews" ORDER BY "reviews"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def home
    croisieres_all = Croisiere.all
    @croisieres = croisieres_all.sort_by {|a| a.croisiere_destination}
   # @last_reviews = Review.all.last(3)
   @last_review = Review.last