app/controllers/reviews_controller.rb

  def create
     @review = Review.new(params_review)
    # binding.pry
     @review.croisiere_id = params[:review][:croisiere_id]
     @test = @review.rating
     @star_rating = @test[0]
     @review.rating = @star_rating
     @review.valid?
     @review.errors.full_messages
    if @review.save
---
INSERT INTO "reviews" ("description", "rating", "nom", "croisiere_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "salut les gens"], ["rating", "3"], ["nom", "Nicolas"], ["croisiere_id", 31], ["created_at", "2021-08-02 07:26:22.190894"], ["updated_at", "2021-08-02 07:26:22.190894"]]

  def destroy
    find_reviews
    @review.destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 25]]

  def find_reviews
    @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]