app/controllers/static_controller.rb

  def transatlantique
    @review = Review.new
    @reviews = Review.all
---
SELECT "reviews".* FROM "reviews"