app/views/reviews/_reviews.html.erb

   <% @reviews.each do |review| %>
 <% croisiere = Croisiere.find(review.croisiere_id) %>
---
SELECT  "croisieres".* FROM "croisieres" WHERE "croisieres"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]