app/views/croisieres/index.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."croisiere_id" = $1  [["croisiere_id", 31]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."croisiere_id" = $1  [["croisiere_id", 31]]
---
        <p><%= link_to "J'y vais", croisiere_path(croisiere), class: 'btn btn-primary' %>
        <% if croisiere.reviews.count != 0 %>
         <% sum_reviews = 0 %>
         <% croisiere.reviews.each {|num| sum_reviews += num.rating.to_i} %>
         <% average_rating = sum_reviews/croisiere.reviews.count %>
          <span class="pull-right" style="font-size: 14px; color: gray;"><%= croisiere.reviews.count%> avis : <%= render 'reviews/rating', stars: average_rating %></span> </p>